import QtQuick 2.15
import QtQuick.Window 2.15
import QtQuick.Controls 2.15
import QtQuick.Controls.Basic

QtObject {
    id: plot

    property string srcTxtpStart: "2122 год. Ученые давно стали предпологать о возможности подобного исхода.
Но никто и подумать не мог, что все произойдет так скоро...

Звезда, которая сопровождала человека и всех живых существ на нашей планете
с самого ее зарождения, стала терять былую мощь.
Лето, даже в самых жарких уголках нашей планеты, стало холоднее самой
суровой зимы в Антарктиде.
Катастрофа подобного масштаба повлекла за собой, раузмеется, не только смену
климата...

Но, как и ко всему, люди вынуждены привыкать и адаптироваться.
И вы не исключение!"
    property string srcTxtpStart_2: "Ваше путешествие начинается в России, Ростовской области, в городе Таганрог.
Вам предстоит попытаться выжить в нынешних суровых реалиях.
Лишь от ваших собственных решений зависит то, где вы окажитесь."
    property string srcTxtstory1_1: "Вы отправляетесь в заброшенный склад, чтобы найти припасы и
средства выживания."
    property string srcTxtstory2_1: "В складе вы обнаруживаете старый генератор, который можно восстановить."
    property string srcTxtstory2_2: "В складе вы обнаруживаете карту с отметками других выживших людей."
    property string srcTxtstory3_1: "Вы решаете восстановить генератор и использовать его для обеспечения
энергией вашего укрытия."
    property string srcTxtstory3_2: "Вы решаете не тратить время на восстановление генератора и идти искать
другой источник энергии."
    property string srcTxtstory3_3: "Вы решаете отправиться на поиски этих людей и присоединиться к ним."
    property string srcTxtstory3_4: "Вы решаете не искать других выживших и оставаться самостоятельным."
    property string srcTxtstory4_1: "Вы успешно восстанавливаете генератор и получаете стабильный источник энергии.

Вы можете использовать энергию для освещения, подключения электроники
или обогрева. Это помогает вам создать комфортные условия в вашем укрытии
и повысить
шансы на выживание."
    property string srcTxtstory4_2: "В процессе восстановления генератора что-то идет не так, и он выходит из строя.

Вы остаетесь без стабильного источника энергии и вынуждены искать
альтернативные варианты. Вам может потребоваться искать другие укрытия
или источники энергии в окружающей среде."
    property string srcTxtstory4_3: "Вы находите солнечные батареи на крыше здания и устанавливаете их для
получения солнечной энергии."
    property string srcTxtstory4_4: "Вы находите небольшой ветрогенератор неподалеку и устанавливаете его для
получения энергии от ветра."
    property string srcTxtstory4_5: "Вы находите группу выживших, которые создали базу для общего выживания и
решаете присоединиться к ним.

Вместе с группой у вас есть больше шансов на выживание, обмен опытом
и ресурсами. Вы можете участвовать в организации защиты, поиске еды и воды,
и создании устойчивого сообщества."
    property string srcTxtstory4_6: "Вы находите одиночного выжившего, который предлагает вам присоединиться к его
маленькой команде.

Вы становитесь частью небольшой группы, которая выживает вместе и зависит от
взаимной поддержки. Ваша команда может иметь свои особенности и стратегии
выживания."
    property string srcTxtstory4_7: "Вы строите свое укрытие и находите способы выживать в одиночку.

Вы должны разработать эффективные методы для обеспечения пищей, водой
и защитой. Ваша выживаемость полностью зависит от ваших навыков и ресурсов."
    property string srcTxtstory4_8: "Вы отправляетесь в путешествие по разрушенному миру, исследуя новые
территории.

Вы рискуете столкнуться с опасностями, но также открываете возможности для
поиска ресурсов и информации. Ваше путешествие может привести к встречам с
другими выжившими или важными открытиями о причинах катастрофы."
    property string srcTxtpSurr: "Под суровым гнетом обстоятельств ваша психика не выдержала. Упав на землю
в полном отчаянии, разочаровании в реальности и себе самом, Вы решили,
что подобная жизнь не для вас и предпочли отдаться воле судьбы.

К вашему счастью, это всего лишь иммитация возможного будущего, игра.
На самом деле вам ничего не угрожает и вы можете попробовать снова пройти
это испытание, как только наберетесь смелости и терпения.

Ну а пока что, Вы знаете где выход."
}
